{
    "vocab": {
        "<PAD>": 0,
        "<UNK>": 1,
        "ive": 2,
        "been": 3,
        "listening": 4,
        "to": 5,
        "this": 6,
        "talk": 7,
        "on": 8,
        "spectroscopy": 9,
        "for": 10,
        "an": 11,
        "hour": 12,
        "and": 13,
        "nothing": 14,
        "is": 15,
        "happening": 16,
        "why": 17,
        "the": 18,
        "setup": 19,
        "differential": 20,
        "equations": 21,
        "so": 22,
        "incredibly": 23,
        "difficult": 24,
        "poorly": 25,
        "documented": 26,
        "lecture": 27,
        "historical": 28,
        "contexts": 29,
        "went": 30,
        "way": 31,
        "too": 32,
        "fast": 33,
        "i": 34,
        "have": 35,
        "no": 36,
        "idea": 37,
        "whats": 38,
        "going": 39,
        "does": 40,
        "bayes": 41,
        "theorem": 42,
        "behave": 43,
        "it": 44,
        "seems": 45,
        "very": 46,
        "counterintuitive": 47,
        "im": 48,
        "interested": 49,
        "in": 50,
        "working": 51,
        "a": 52,
        "research": 53,
        "project": 54,
        "related": 55,
        "chemical": 56,
        "equilibrium": 57,
        "perception": 58,
        "thresholds": 59,
        "homework": 60,
        "extremely": 61,
        "monotonous": 62,
        "cant": 63,
        "stay": 64,
        "focused": 65,
        "can": 66,
        "someone": 67,
        "explain": 68,
        "how": 69,
        "industrialization": 70,
        "works": 71,
        "am": 72,
        "totally": 73,
        "confused": 74,
        "ecological": 75,
        "niches": 76,
        "mastered": 77,
        "core": 78,
        "concepts": 79,
        "of": 80,
        "thematic": 81,
        "analysis": 82,
        "bring": 83,
        "advanced": 84,
        "stuff": 85,
        "we": 86,
        "apply": 87,
        "partial": 88,
        "derivatives": 89,
        "solve": 90,
        "other": 91,
        "problem": 92,
        "portfolio": 93,
        "optimization": 94,
        "are": 95,
        "there": 96,
        "any": 97,
        "applications": 98,
        "fluid": 99,
        "mechanics": 100,
        "modern": 101,
        "industry": 102,
        "social": 103,
        "influence": 104,
        "limits": 105,
        "continuity": 106,
        "scale": 107,
        "realworld": 108,
        "datasets": 109,
        "id": 110,
        "love": 111,
        "know": 112,
        "more": 113,
        "making": 114,
        "great": 115,
        "progress": 116,
        "renaissance": 117,
        "art": 118,
        "its": 119,
        "all": 120,
        "clicking": 121,
        "completely": 122,
        "lost": 123,
        "political": 124,
        "revolutions": 125,
        "simple": 126,
        "terms": 127,
        "assignment": 128,
        "was": 129,
        "finished": 130,
        "ten": 131,
        "minutes": 132,
        "tired": 133,
        "getting": 134,
        "stuck": 135,
        "basic": 136,
        "syntax": 137,
        "errors": 138,
        "probability": 139,
        "distributions": 140,
        "frustrated": 141,
        "with": 142,
        "should": 143,
        "trying": 144,
        "periodic": 145,
        "trends": 146,
        "bug": 147,
        "hours": 148,
        "still": 149,
        "failing": 150,
        "error": 151,
        "message": 152,
        "organizational": 153,
        "behavior": 154,
        "useless": 155,
        "treaty": 156,
        "negotiations": 157,
        "thermochemistry": 158,
        "class": 159,
        "moving": 160,
        "at": 161,
        "snails": 162,
        "pace": 163,
        "disengaged": 164,
        "angular": 165,
        "momentum": 166,
        "neurotransmitters": 167,
        "consumer": 168,
        "psychology": 169,
        "dry": 170,
        "falling": 171,
        "asleep": 172,
        "thermodynamic": 173,
        "cycles": 174,
        "professors": 175,
        "slides": 176,
        "eigenvalues": 177,
        "eigenvectors": 178,
        "just": 179,
        "walls": 180,
        "text": 181,
        "uninteresting": 182,
        "dna": 183,
        "replication": 184,
        "recursion": 185,
        "supply": 186,
        "chain": 187,
        "logistics": 188,
        "circuit": 189,
        "simulation": 190,
        "symbolism": 191,
        "memory": 192,
        "retrieval": 193,
        "fascinating": 194,
        "where": 195,
        "read": 196,
        "about": 197,
        "keep": 198,
        "when": 199,
        "formula": 200,
        "feedback": 201,
        "control": 202,
        "loops": 203,
        "developmental": 204,
        "stages": 205,
        "question": 206,
        "instructions": 207,
        "unclear": 208,
        "aerodynamics": 209,
        "really": 210,
        "struggling": 211,
        "grasp": 212,
        "concept": 213,
        "economic": 214,
        "depressions": 215,
        "feel": 216,
        "like": 217,
        "throwing": 218,
        "my": 219,
        "laptop": 220,
        "out": 221,
        "window": 222,
        "genre": 223,
        "conventions": 224,
        "annoying": 225,
        "sql": 226,
        "joins": 227,
        "solution": 228,
        "clean": 229,
        "efficient": 230,
        "perfectly": 231,
        "dont": 232,
        "see": 233,
        "relevance": 234,
        "narrative": 235,
        "voices": 236,
        "real": 237,
        "life": 238,
        "empty": 239,
        "theory": 240,
        "geometric": 241,
        "proofs": 242,
        "allocation": 243,
        "digital": 244,
        "logic": 245,
        "gates": 246,
        "immune": 247,
        "response": 248,
        "electromagnetic": 249,
        "induction": 250,
        "quantum": 251,
        "entanglement": 252,
        "laws": 253,
        "regular": 254,
        "expressions": 255,
        "compiler": 256,
        "driving": 257,
        "me": 258,
        "crazy": 259,
        "makes": 260,
        "sense": 261,
        "ancient": 262,
        "civilizations": 263,
        "followed": 264,
        "every": 265,
        "step": 266,
        "military": 267,
        "strategies": 268,
        "tutorial": 269,
        "crashes": 270,
        "ready": 271,
        "special": 272,
        "relativity": 273,
        "anyone": 274,
        "who": 275,
        "understand": 276,
        "difference": 277,
        "between": 278,
        "these": 279,
        "two": 280,
        "algorithms": 281,
        "protein": 282,
        "synthesis": 283,
        "modification": 284,
        "stoichiometric": 285,
        "calculations": 286,
        "fully": 287,
        "financial": 288,
        "accounting": 289,
        "now": 290,
        "completed": 291,
        "exercises": 292,
        "easily": 293,
        "curious": 294,
        "what": 295,
        "happens": 296,
        "if": 297,
        "change": 298,
        "parameters": 299,
        "pointer": 300,
        "references": 301,
        "action": 302,
        "potentials": 303,
        "nightmare": 304,
        "hard": 305,
        "redox": 306,
        "reactions": 307,
        "postcolonial": 308,
        "literature": 309,
        "integrals": 310,
        "gene": 311,
        "splicing": 312,
        "do": 313,
        "need": 314,
        "memorize": 315,
        "formulas": 316,
        "feels": 317,
        "pointless": 318,
        "ethics": 319,
        "rhetorical": 320,
        "devices": 321,
        "mathematical": 322,
        "connection": 323,
        "linear": 324,
        "transformations": 325,
        "fields": 326,
        "market": 327,
        "segmentation": 328,
        "gas": 329,
        "test": 330,
        "breeze": 331,
        "got": 332,
        "perfect": 333,
        "score": 334,
        "nuclear": 335,
        "fission": 336,
        "structural": 337,
        "load": 338,
        "corporate": 339,
        "finance": 340,
        "multithreading": 341,
        "microeconomic": 342,
        "models": 343,
        "researchers": 344,
        "open": 345,
        "problems": 346,
        "section": 347,
        "three": 348,
        "times": 349,
        "cad": 350,
        "modeling": 351,
        "acidbase": 352,
        "titration": 353,
        "movements": 354,
        "want": 355,
        "explore": 356,
        "history": 357,
        "development": 358,
        "theories": 359,
        "learning": 360,
        "watching": 361,
        "paint": 362,
        "zero": 363,
        "excitement": 364,
        "material": 365,
        "strength": 366,
        "covalent": 367,
        "bonding": 368,
        "structuralism": 369,
        "interesting": 370,
        "perspective": 371,
        "compare": 372,
        "others": 373,
        "implementing": 374,
        "straightforward": 375,
        "knew": 376,
        "exactly": 377,
        "backpropagation": 378,
        "get": 379,
        "relationship": 380,
        "variables": 381,
        "schrodinger": 382,
        "equation": 383,
        "organic": 384,
        "molecular": 385,
        "orbitals": 386,
        "solved": 387,
        "entire": 388,
        "worksheet": 389,
        "without": 390,
        "looking": 391,
        "hints": 392,
        "photosynthesis": 393,
        "pathways": 394,
        "phylogenetic": 395,
        "trees": 396,
        "dynamics": 397,
        "french": 398,
        "revolution": 399,
        "stressstrain": 400,
        "signal": 401,
        "processing": 402,
        "spent": 403,
        "whole": 404,
        "weekend": 405,
        "literary": 406,
        "made": 407,
        "absolutely": 408,
        "gradient": 409,
        "descent": 410,
        "metaphorical": 411,
        "structures": 412,
        "binary": 413,
        "search": 414,
        "mitosis": 415,
        "meiosis": 416,
        "cellular": 417,
        "respiration": 418,
        "confident": 419,
        "ahead": 420,
        "midterm": 421,
        "diagrams": 422,
        "gravitational": 423,
        "api": 424,
        "routing": 425,
        "classical": 426,
        "conditioning": 427,
        "balance": 428,
        "sheets": 429,
        "merge": 430,
        "sort": 431,
        "find": 432,
        "tedious": 433,
        "rote": 434,
        "repetition": 435,
        "fourier": 436,
        "series": 437,
        "poetic": 438,
        "meters": 439,
        "defense": 440,
        "mechanisms": 441,
        "costbenefit": 442,
        "marketing": 443,
        "mental": 444,
        "health": 445,
        "disorders": 446,
        "colonialism": 447,
        "homeostasis": 448,
        "natural": 449,
        "selection": 450,
        "cold": 451,
        "war": 452,
        "diplomacy": 453,
        "matrix": 454,
        "multiplication": 455,
        "projectile": 456,
        "motion": 457,
        "another": 458,
        "rather": 459,
        "anything": 460,
        "else": 461,
        "right": 462,
        "enzyme": 463,
        "kinetics": 464,
        "cognitive": 465,
        "dissonance": 466,
        "docker": 467,
        "containers": 468,
        "sources": 469,
        "macroeconomics": 470,
        "vector": 471,
        "spaces": 472,
        "personality": 473,
        "traits": 474,
        "heat": 475,
        "transfer": 476,
        "character": 477,
        "waveparticle": 478,
        "duality": 479
    },
    "classes": {
        "Bored": 0,
        "Confident": 1,
        "Confused": 2,
        "Curious": 3,
        "Frustrated": 4
    }
}